"""Doc."""
# 1. типы данных и переменная
# int, float, boolean, str, list, None

value = None
# print(type(value))
a = 123
b = 1.23
# print(type(a))
# print(type(b))
value = 1234
# print(type(value))

s = "hello, 'world!"  # хитрость с ковычками;
# s = "hello, \n'world!"  # преход на новую строку;
# print(s)  # вывод строки
# print(a, '-', b, '-', s)
# print('{} - {} - {}'.format(a, b, s))
# print(f'{a} - {b} - {s}')  # интерполяция(приоритетный вариант вывода)
# print('{1} - {2} - {0}'.format(a, b, s))    # последовательность вывода

# #  boolean
# f = False
# g = True
# print(f)
# print(g)

# списки(массивы);
# list = ['1', '2', '3', 'hello']
# col = [1, 2, 3, 4.5, True]
# print(list)
# print(col)

# 2. Ввод и вывод данных
# print, input

# print('Введите а')
# a = float(input())  # можно заменить на int
# print('Введите b')
# b = float(input())  # можно заменить на int
# print(a, '+', b, '=', a+b)
# print('{} - {}'.format(a, b))
# print(f'{a} - {b}')

# 3. Арифметические операции
# +, -, *, /, %, //, **
# Приоритет операций
# **, ⊕, ⊖, *, /, //, %, +, -
# ( ) Скобки меняют приоритет
# Сокращенные операции присваивания

# a = -123    # унарный минус
# b = +321    # унарный плюс

# a = 1.3223
# b = 3

# # c = a//b  # деление в целых числах
# # c = a % b  # получить остаток от деления
# # c = a ** b  # возведение в степень
# c = round(a * b, 3)   # если не передавать ",3" будет округленно по мат
# правилам
# # print(c)

# a = 3
# # a = a + 5
# a += 5 # сокращенные операции
# print(a)

# 4. Логические операции
# >, >=, <, <=, ==, !=
# not, and, or – не путать с &, |,
# ^
# Кое-что ещё: is, is not, in, not in
# gen

# a = 1 > 4 and 5 > 2
# a = 1 == 2
# a = 1 != 2
# print(a)

# a = 'qwe'
# b = 'qwe'
# print(a == b)

# a = 1 < 3 < 5  # тройные неравенства
# print(a)
# func = 1
# T = 4
# x = 123
# print(func < T < (x))

# f = 1 > 2 or 4 < 6
# print(f)

f = [1, 2, 3, 4]
# print(f)
# print(2 not in f)   # проверка списка на отсутствие 2ки
# print(2 in f)   # проверка списка на наличие 2ки

# is_odd = f[0] % 2 == 0  # проверка на четность числа
is_odd = not f[0] % 2  # проверка на четность числа(более приемлемый вариант
# записи)
print(is_odd)
